{"keras_version": "2.0.4", "class_name": "Model", "backend": "tensorflow", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 32, 32, 3], "sparse": false, "name": "input_1"}, "name": "input_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_regularizer": null, "strides": [1, 1], "trainable": true, "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "use_bias": true}, "name": "conv2d_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"kernel_regularizer": null, "strides": [1, 1], "trainable": true, "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "use_bias": true}, "name": "conv2d_2"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_1"}, "name": "max_pooling2d_1"}, {"class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"rate": 0.25, "trainable": true, "name": "dropout_1"}, "name": "dropout_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"kernel_regularizer": null, "strides": [1, 1], "trainable": true, "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "name": "conv2d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "use_bias": true}, "name": "conv2d_3"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"kernel_regularizer": null, "strides": [1, 1], "trainable": true, "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "name": "conv2d_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "use_bias": true}, "name": "conv2d_4"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_2"}, "name": "max_pooling2d_2"}, {"class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"rate": 0.25, "trainable": true, "name": "dropout_2"}, "name": "dropout_2"}, {"class_name": "Flatten", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_1"}, "name": "flatten_1"}, {"class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "trainable": true}, "name": "dense_1"}, {"class_name": "Dropout", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"rate": 0.5, "trainable": true, "name": "dropout_3"}, "name": "dropout_3"}, {"class_name": "Dense", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "config": {"name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "trainable": true}, "name": "dense_2"}]}}